In [5]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

# Control the display of seaborn data

In [6]:
df=pd.read_csv("bse_dataset.csv")
df

,Timestamp,What is your gender?,Age,What is your emotion?,Year of birth,What is your CGPA?,Do you have a Girl Friend or BOY Friend,Do you have Depression?,Do you have Anxiety?,Do you have Panic attack?,Did you have seek any specialist for a treatment?
0,05/07/2023 09:38:39,Male,21,Content,2002,4.22,No,No,Yes,Yes,Yes
1,05/07/2023 09:38:57,Marabou stock,45,Weird,2100,8.9,Yes,Yes,Yes,Yes,No
2,05/07/2023 09:39:09,Female,20,Happy,2002,3.98,No,No,Yes,Yes,No
3,05/07/2023 09:39:12,Male,21,Happy,2003,4.37,No,No,No,No,Nope
4,05/07/2023 09:39:14,Female,21,Happy,2002,3.63,No,No,No,No,No
...,...,...,...,...,...,...,...,...,...,...,...
92,05/07/2023 09:53:56,Female,68,Sad,1953,4.8,No,Yes,Yes,Yes,Yes
93,05/07/2023 09:54:13,Male,29,Hopeful,1994,I don't know yet,"Sure, multiple girlfriends",No,No,No,No
94,05/07/2023 09:54:28,Male,22,Fighting poverty,2001,3.12,Girl friends are thieves,Yes,Yes,No,No
95,05/07/2023 09:54:36,Male,23,good and bad,2000,3.5,Namiiro Zahara Bidin,No,No,No,No
96,05/07/2023 09:54:52,male,30,hunger,2023,5,ARI,no,yeah,nah,yeah

# checking columns names

In [7]:
df.columns

Index(['Timestamp', 'What is your gender?', 'Age', 'What is your emotion?',
       'Year of birth', 'What is your CGPA?',
       'Do you have a Girl Friend or BOY Friend', 'Do you have Depression?',
       'Do you have Anxiety?', 'Do you have Panic attack?',
       'Did you have seek any specialist for a treatment? '],
      dtype='object')

# Checking for basic information # the datatypes of the columns listed

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97 entries, 0 to 96
Data columns (total 11 columns):
 #   Column                                              Non-Null Count  Dtype
---  ------                                              --------------  -----
 0   Timestamp                                           97 non-null     object
 1   What is your gender?                                97 non-null     object
 2   Age                                                 97 non-null     int64
 3   What is your emotion?                               96 non-null     object
 4   Year of birth                                       97 non-null     object
 5   What is your CGPA?                                  97 non-null     object
 6   Do you have a Girl Friend or BOY Friend             97 non-null     object
 7   Do you have Depression?                             97 non-null     object
 8   Do you have Anxiety?                                97 non-null     object
 9   Do you have Panic attack?                           97 non-null     object
 10  Did you have seek any specialist for a treatment?   97 non-null     object
dtypes: int64(1), object(10)
memory usage: 8.5+ KB

# Checking for null values

In [14]:
df.isnull().sum().sort_values(ascending=False)

What is your emotion?                                 1
Timestamp                                             0
What is your gender?                                  0
Age                                                   0
Year of birth                                         0
What is your CGPA?                                    0
Do you have a Girl Friend or BOY Friend               0
Do you have Depression?                               0
Do you have Anxiety?                                  0
Do you have Panic attack?                             0
Did you have seek any specialist for a treatment?     0
dtype: int64

# Check for the shape of data

In [10]:
df.shape

(97, 11)

# Check for null values in percentage

In [15]:
for i in df.columns:
    if df[i].isnull().any():
        print(i,".....",df[i].isnull().sum()*100/df.shape[0],"%")

What is your emotion? ..... 1.0309278350515463 %

# Afternoon session

In [9]:
import pandas as pd
df=pd.DataFrame()
print(df)
print(pd.__version__)

Empty DataFrame
Columns: []
Index: []
1.5.3

In [16]:
data = {'Name': ['adam', 'ena', 'linda', 'daisy'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'London', 'Paris', 'kampala']}
df1 = pd.DataFrame(data)
print(df1)

    Name  Age      City
0   adam   25  New York
1    ena   30    London
2  linda   35     Paris
3  daisy   28   kampala

# Acessing the items

In [18]:
df1.City

0    New York
1      London
2       Paris
3     kampala
Name: City, dtype: object

In [17]:
df1.Age

0    25
1    30
2    35
3    28
Name: Age, dtype: int64

# class-exercise
#creating a simple pandas series from the dictionary showing days and dates

In [19]:
data = {'Monday': '2023-07-03',
        'Tuesday': '2023-07-04',
        'Wednesday': '2023-07-05'}
series = pd.Series(data)
print(series)

Monday       2023-07-03
Tuesday      2023-07-04
Wednesday    2023-07-05
dtype: object

In [14]:
print(series['Monday'])  
# Output: 2023-07-03

2023-07-03

# Creating a pandas series for only moday and tuesday

In [20]:
data = {'Monday': '2023-07-03',
        'Tuesday': '2023-07-04',
        'Wednesday': '2023-07-05'}
wanted_data = {key: value for key, value in data.items() if key in ['Monday', 'Tuesday']}
series = pd.Series(wanted_data)
print(series)

Monday     2023-07-03
Tuesday    2023-07-04
dtype: object

# class-exercise2

In [16]:
# using different functions given to analyze 
#and clean data
#head()-displays the first five columns in the dataset

In [21]:
mine=pd.read_csv("mine.csv")
mine.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [22]:
work=pd.read_csv("work.csv")
work.head()

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

In [19]:
#using tail()
#Display the last 5 rows of the dataset using tail()

In [23]:
mine=pd.read_csv("mine.csv")
mine.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [24]:
work=pd.read_csv("work.csv")
work.tail()

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [22]:
#using info() functions which gives a
#summary of the dataset including their column datatypes

In [23]:
mine.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [26]:
work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes

In [25]:
#using dropna() function which drops rows
#with missing values eg tevor was dropped

In [27]:
work.dropna()

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [27]:
mine.dropna()

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [28]:
# using fillna() function which displays the dataset after 
#filling missing values

In [29]:
data_filling = work.fillna(0)
print(data_filling)

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone      0       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train        0
6   Jesca      Mbarara     21       84

In [30]:
fill_in = mine.fillna(0)
print(fill_in)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

# Qn2. Performing appropriate methods to remove wrong data

In [45]:
null_value = work.isnull()
print(null_value)

    Name   city    age  py-score
0  False  False  False     False
1  False  False  False     False
2  False  False   True     False
3  False  False  False     False
4  False  False  False      True
5  False  False  False     False

In [32]:
null_2=mine.isnull()
null_2

     Duration  Pulse  Maxpulse  Calories
0       False  False     False     False
1       False  False     False     False
2       False  False     False     False
3       False  False     False     False
4       False  False     False     False
..        ...    ...       ...       ...
164     False  False     False     False
165     False  False     False     False
166     False  False     False     False
167     False  False     False     False
168     False  False     False     False

[169 rows x 4 columns]

In [33]:
drop_col = work.dropna()
print(drop_col.to_string())

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [34]:

#here it dropped one column of age
drop_column = work.dropna(1)
print(drop_column.to_string())

     Name         city
0    Emma      Kampala
1  Wilber        Mbale
2   Robin         Gulu
3   Tevor  Livingstone
4    Yeko       Tororo
5  Miriam         Arua
6   Jesca      Mbarara

C:\Users\Linda\AppData\Local\Temp\ipykernel_5644\1537824824.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.dropna will be keyword-only.
  drop_column = work.dropna(1)

# Removing duplicates from the dataset

In [36]:
mine.drop_duplicates(inplace=True)
print(mine)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[162 rows x 4 columns]

In [39]:
work1.drop_duplicates(inplace=True)
work1.reset_index(drop=True, inplace=True)
print(work1)

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Tevor  Livingstone    NaN       89
3    Yeko       Tororo     20       94
4  Miriam         Arua  Train      NaN
5   Jesca      Mbarara     21       84

In [37]:
my_correlation=mine.corr()
my_correlation

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.162098  0.003578  0.923053
Pulse    -0.162098  1.000000  0.787035  0.015301
Maxpulse  0.003578  0.787035  1.000000  0.195309
Calories  0.923053  0.015301  0.195309  1.000000